# LoadResult Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..LoadResult Property
LinkLoadResult Class See Also
---
Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LinkLoadResultType LoadResult { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadResult As LinkLoadResultType
	Get
```

Visual C++
---
```text
public:
property LinkLoadResultType LoadResult {
	LinkLoadResultType get ();
}
```

# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace